iPig/src/InformationRegisters/КарточкаСвиноматки/КарточкаСвиноматки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаСвиноматки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Живорожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мертвые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Слаборожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Муммии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереведеноПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Падеж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Перевод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОтъемышей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кормилица</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВсегоПотеряноКормодней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПадежПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДнейДо1Осеменения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоАбортов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖиворожденныхВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖиворожденныхНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МертворожденныхНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтнятыхПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтнятоНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПадежДоОтъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СупоросныхДнейНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодсосныхДнейНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПустыхДнейНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОпоросовНаСвиноматкуВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПустыеКормодни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтнятоПоросятНаСвиноматкуВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖиворожденныхНаСвиноматкуВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодРаботника</name>
    <type>
      <types>CatalogRef.Работник</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСлучка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХрякОсеменен</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУЗИ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатУЗИ</name>
    <type>
      <types>EnumRef.РезультатУЗИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАборта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МачехаАборт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IDГнезда</name>
    <type>
      <types>CatalogRef.IDГнезда</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтъема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МачехаОтъем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДо1Случки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПустыеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЛактации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодсосныйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВыбытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВыбытия</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСлучка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеПородыМать</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеПородыОтец</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDНомер</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛевыхСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравыхСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРожденияОтец</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоМать</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРожденияМать</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.КритическиеДни</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаАбортаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пролечено</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВакцинации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DanAvlTagID</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/Пол/Пол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Пол</name>
  <enumValues>
    <name>Хряк</name>
  </enumValues>
  <enumValues>
    <name>Свинка</name>
  </enumValues>
</mdclass:Enum>

iPig/src/InformationRegisters/КарточкаСвиноматки/Forms/ФормаНумерации/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДанныеВБазе = Ложь;
	ПородаОтец							= Параметры.ПородаОтец;
	ПородаМать							= Параметры.ПородаМать; 	
	//Вставить содержимое обработчика    
	НоваяСтрока 						= ТЧДанные.Добавить();
	НоваяСтрока.ДатаСобытия				= ТекущаяДата();
	НоваяСтрока.НомерЖивотного 			= Параметры.НомерЖивотного;
	НоваяСтрока.Порода					= Параметры.Порода;
	НоваяСтрока.КоличествоПоросят 		= Параметры.КоличествоПоросят;
	НоваяСтрока.НомерФермы          	= Константы.НомерФермыDG.Получить();
	НоваяСтрока.СерийныйНомерСвинкиОт 	= Константы.СерийныйНомерСвинкиОт.Получить();
	НоваяСтрока.СерийныйНомерСвинкиДо 	= Константы.СерийныйНомерСвинкиОт.Получить() + Параметры.КоличествоПоросят - 1;
	Если ПородаОтец = Справочники.Порода.НайтиПоРеквизиту("КодПороды", "22") И ПородаМать
		= Справочники.Порода.НайтиПоРеквизиту("КодПороды", "22") Тогда
		НоваяСтрока.Порода	= Справочники.Порода.НайтиПоРеквизиту("КодПороды", "22");
	ИначеЕсли ПородаОтец = Справочники.Порода.НайтиПоРеквизиту("КодПороды", "11") И ПородаМать
		= Справочники.Порода.НайтиПоРеквизиту("КодПороды", "22") Тогда
		НоваяСтрока.Порода	= Справочники.Порода.НайтиПоРеквизиту("КодПороды", "12");
	КонецЕсли;
	КодПородыИФермы = ПолучитьКодПородыИФермыНаСервере();
 
	//КодПородыНомерФермы					= Константы.НомерФермыDG.Получить()
	НоваяСтрока.НомерТатуОт             = СтрЗаменить(КодПородыИФермы + Строка(НоваяСтрока.СерийныйНомерСвинкиОт), " ",
		"");
	НоваяСтрока.НомерТатуДо             = СтрЗаменить(КодПородыИФермы + Строка(НоваяСтрока.СерийныйНомерСвинкиДо), " ",
		"");
	КоличествоПоросят					= Параметры.КоличествоПоросят;
	НомерЖивотногоОтец					= Параметры.Отец;
	НомерЖивотногоМать					= Параметры.Мать;
	ДатаРождения                        = Параметры.ДатаРождения;
	ДатаВвода							= Параметры.ДатаВвода;

	ЗаполнитьДанныеПлемСтадо(Параметры.Мать, ДатаВвода);
	Если Не ДанныеВБазе Тогда
		ЗаполнитьТЧДанныеНаКлиенте(НоваяСтрока.КоличествоПоросят, НоваяСтрока.СерийныйНомерСвинкиОт,
			НоваяСтрока.НомерЖивотного);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКодПородыИФермыНаСервере()

	Перем КодПородыИФермы, ПрефиксПороды, ЧисловойКодПороды;
	ПрефиксПороды = "";
	ЧисловойКодПороды = "";

	Если ПородаОтец = Справочники.Порода.НайтиПоРеквизиту("КодПороды", "22") И ПородаМать
		= Справочники.Порода.НайтиПоРеквизиту("КодПороды", "22") Тогда
		ПрефиксПороды = "Y";
		ЧисловойКодПороды = "120";
	ИначеЕсли ПородаОтец = Справочники.Порода.НайтиПоРеквизиту("КодПороды", "11") И ПородаМать
		= Справочники.Порода.НайтиПоРеквизиту("КодПороды", "22") Тогда
		ПрефиксПороды = "L";
		ЧисловойКодПороды = "100";
	КонецЕсли;
	КодПородыИФермы = ПрефиксПороды + Константы.НомерФермыDG.Получить() + ЧисловойКодПороды;
	Возврат КодПородыИФермы;

КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеПлемСтадо(Знач Мать, Знач ДатаВвода)
	НаборЗаписей = РегистрыСведений.ПлемСтадо.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РодителиМать.Установить(Мать);
	НаборЗаписей.Отбор.РодителиДатаВвода.Установить(ДатаВвода);
	НаборЗаписей.Отбор.ДатаРождения.Установить(ДатаРождения);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Для Каждого Стр Из НаборЗаписей Цикл
			НоваяСтрока	 					= ТЧТату.Добавить();
			НоваяСтрока.DGTagID 			= Стр.DGTagId;
			НоваяСтрока.Пол					= ПредопределенноеЗначение("Перечисление.Пол.Свинка");
			НоваяСтрока.УшнойВыщип 			= Прав(Строка(НомерЖивотногоМать), 2);
			НоваяСтрока.НомерЖивотногоОтец 	= Стр.РодителиОтец;
			НоваяСтрока.ПородаОтец          = Стр.РодителиОтецПорода;
			НоваяСтрока.НомерЖивотногоМать  = Стр.РодителиМать;
			НоваяСтрока.ПородаМать          = Стр.РодителиМатьПорода;
			НоваяСтрока.Порода              = Стр.КодПороды;
			НоваяСтрока.IDНомер				= Стр.IDНомер;
		КонецЦикла;
		ДанныеВБазе = Истина;
		ТЧДанные[0].КоличествоПоросят = НаборЗаписей.Количество();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧДанныеКоличествоПоросятПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧДанные.ТекущиеДанные;

	КоличествоПоросятDG 	= ТекущаяСтрока.КоличествоПоросят;
	КодПородыИФермы 		= ПолучитьКодПородыИФермыНаСервере();
	Если КоличествоПоросятDG > КоличествоПоросят Тогда
		КоличествоПоросятDG 			= КоличествоПоросят;
		ТекущаяСтрока.КоличествоПоросят = КоличествоПоросятDG;
		Сообщить("Максимальное количество поросят " + Строка(КоличествоПоросят));
	КонецЕсли;
	ТекущаяСтрока.СерийныйНомерСвинкиОт 	= ТекущаяСтрока.СерийныйНомерСвинкиОт;
	ТекущаяСтрока.СерийныйНомерСвинкиДо 	= ТекущаяСтрока.СерийныйНомерСвинкиОт + КоличествоПоросятDG - 1;
	ТекущаяСтрока.НомерТатуОт             = СтрЗаменить(КодПородыИФермы + Строка(ТекущаяСтрока.СерийныйНомерСвинкиОт),
		" ", "");
	ТекущаяСтрока.НомерТатуДо             = СтрЗаменить(КодПородыИФермы + Строка(ТекущаяСтрока.СерийныйНомерСвинкиДо),
		" ", "");

	Если Не ДанныеВБазе Тогда
		ЗаполнитьТЧДанныеНаКлиенте(КоличествоПоросятDG, ТекущаяСтрока.СерийныйНомерСвинкиОт,
			ТекущаяСтрока.НомерЖивотного);
	КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ЗаполнитьТЧДанныеНаКлиенте(Знач КоличествоПоросятDG, Знач СерийныйНомерСвинкиОт, Знач НомерЖивотного,
	Знач ПрефиксСвинки = "")

	Перем НоваяСтрока, Счетчик;

	ТЧТату.Очистить();
	КодПородыИФермы 		= ПолучитьКодПородыИФермыНаСервере();
	Если Не ЗначениеЗаполнено(КодПородыИФермы) Тогда
		КодПородыИФермы = ПрефиксСвинки;
	КонецЕсли;

	Для Счетчик = 1 По КоличествоПоросятDG Цикл
		НоваяСтрока	 					= ТЧТату.Добавить();
		Если ЗначениеЗаполнено(Константы.НомерФермыDG.Получить()) Тогда
			НоваяСтрока.DGTagID 			= СтрЗаменить(КодПородыИФермы + Строка(СерийныйНомерСвинкиОт + Счетчик - 1),
				" ", "");
		Иначе
			НоваяСтрока.IDНомер				= СтрЗаменить(КодПородыИФермы + Строка(СерийныйНомерСвинкиОт + Счетчик
				- 1), " ", "");
		КонецЕсли;
		НоваяСтрока.Пол					= ПредопределенноеЗначение("Перечисление.Пол.Свинка");
		Если Константы.УшнойВыщипИзНомераСвиноматки.Получить() Тогда
			НоваяСтрока.УшнойВыщип 			= Прав(Строка(НомерЖивотного), 2);
		КонецЕсли;
		НоваяСтрока.НомерЖивотногоОтец 	= НомерЖивотногоОтец;
		НоваяСтрока.ПородаОтец          = ПородаОтец;
		НоваяСтрока.НомерЖивотногоМать  = НомерЖивотногоМать;
		НоваяСтрока.ПородаМать          = ПородаМать;
		Если ПородаОтец = Справочники.Порода.НайтиПоРеквизиту("КодПороды", "22") И ПородаМать
			= Справочники.Порода.НайтиПоРеквизиту("КодПороды", "22") Тогда
			НоваяСтрока.Порода	= Справочники.Порода.НайтиПоРеквизиту("КодПороды", "22");
		ИначеЕсли ПородаОтец = Справочники.Порода.НайтиПоРеквизиту("КодПороды", "11") И ПородаМать
			= Справочники.Порода.НайтиПоРеквизиту("КодПороды", "22") Тогда
			НоваяСтрока.Порода	= Справочники.Порода.НайтиПоРеквизиту("КодПороды", "12");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьНомерФермыНаСервере()

	Возврат Константы.НомерФермыDG.Получить();

КонецФункции
&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	НаборЗаписей = РегистрыСведений.ПлемСтадо.СоздатьНаборЗаписей();
	Для Каждого Стр Из ТЧТату Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		DGTagID = Справочники.IDНомер.НайтиПоНаименованию(Стр.DGTagId);
		Если DGTagID = Справочники.IDНомер.ПустаяСсылка() Тогда
			НовыйИД = Справочники.IDНомер.СоздатьЭлемент();
			НовыйИД.Наименование = Стр.DGTagId;
			НовыйИД.Записать();
			DGTagID = НовыйИД.Ссылка;
		КонецЕсли;
		IDНомер = Справочники.IDНомер.НайтиПоНаименованию(Стр.IDНомер);
		Если IDНомер = Справочники.IDНомер.ПустаяСсылка() Тогда
			НовыйИД = Справочники.IDНомер.СоздатьЭлемент();
			НовыйИД.Наименование = Стр.IDНомер;
			НовыйИД.Записать();
			IDНомер = НовыйИД.Ссылка;
		КонецЕсли;
		НоваяСтрока.DGTagId 			= DGTagId;
		НоваяСтрока.IDНомер				= IDНомер;
		НоваяСтрока.ДатаРождения    	= ДатаРождения;
		НоваяСтрока.РодителиМать		= НомерЖивотногоМать;
		НоваяСтрока.РодителиДатаВвода	= ДатаВвода;
		НоваяСтрока.РодителиМатьПорода  = Стр.ПородаМать;
		НоваяСтрока.РодителиОтец		= Стр.НомерЖивотногоОтец;
		НоваяСтрока.РодителиОтецПорода	= Стр.ПородаОтец;
		НоваяСтрока.КодПороды			= Стр.Порода;
		НоваяСтрока.Стадо				= Сред(DGTagId.Наименование, 2, 4);
		НоваяСтрока.УшнойВыщип			= Стр.УшнойВыщип;
	КонецЦикла;
	НаборЗаписей.Записать();
	Константы.СерийныйНомерСвинкиОт.Установить(ТЧДанные[0].СерийныйНомерСвинкиДо + 1);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДанныеНомерТатуОтПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.ТЧДанные.ТекущиеДанные;
	КоличествоПоросятDG 	= ТекущаяСтрока.КоличествоПоросят;
	НомерСвинкиОт = ТолькоЧисла(ТекущаяСтрока.НомерТатуОт);
	ПрефиксСвинки = СтрЗаменить(ТекущаяСтрока.НомерТатуОт, НомерСвинкиОт, "");
	КодПородыИФермы = ПрефиксСвинки;

	ТекущаяСтрока.СерийныйНомерСвинкиОт 	= НомерСвинкиОт;
	ТекущаяСтрока.СерийныйНомерСвинкиДо 	= ТекущаяСтрока.СерийныйНомерСвинкиОт + КоличествоПоросятDG - 1;
	ТекущаяСтрока.НомерТатуОт             = СтрЗаменить(КодПородыИФермы + Строка(ТекущаяСтрока.СерийныйНомерСвинкиОт),
		" ", "");
	ТекущаяСтрока.НомерТатуДо             = СтрЗаменить(КодПородыИФермы + Строка(ТекущаяСтрока.СерийныйНомерСвинкиДо),
		" ", "");

	Если Не ДанныеВБазе Тогда
		ЗаполнитьТЧДанныеНаКлиенте(КоличествоПоросятDG, ТекущаяСтрока.СерийныйНомерСвинкиОт,
			ТекущаяСтрока.НомерЖивотного, ПрефиксСвинки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ТолькоЧисла(СтрокаРазличныеСимволы)

	УдаляемыеСимволы = СтрСоединить(СтрРазделить(СтрокаРазличныеСимволы, "0123456789", Ложь));
	Возврат СтрСоединить(СтрРазделить(СтрокаРазличныеСимволы, УдаляемыеСимволы, Ложь));

КонецФункции
